# More Actor Metrics Were Needed So We Scraped

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./actors.csv")

In [3]:
df

,actor,Gross Earnings by movie starred in / number of movies starred in
0,"Scarlett Johansson,Robert Downey, Jr.,Samuel L...","$453,777,860,$334,793,724,$224,071,059,$580,99..."

# Cleaning the data

In [4]:
actors_expanded = df['actor'].str.split(',', expand=True)

In [5]:
a = actors_expanded.T

In [7]:
a.drop(2, inplace=True)

In [10]:
a.reset_index(inplace=True)

In [11]:
a

    index                   0
0       0  Scarlett Johansson
1       1       Robert Downey
2       3   Samuel L. Jackson
3       4         Chris Pratt
4       5     Chris Hemsworth
..    ...                 ...
95     96      Channing Tatum
96     97       Geoffrey Rush
97     98          Mike Myers
98     99     Sam Worthington
99    100         Paul Walker

[100 rows x 2 columns]

In [13]:
Average Earnings = df['Gross Earnings by movie starred in / number of movies starred in'].str.split(',', expand=True)

SyntaxError: invalid syntax (2724222250.py, line 1)

In [15]:
b = df['Gross Earnings by movie starred in / number of movies starred in']

In [16]:
c = b.str.split('$', expand=True)

In [18]:
c = c.T

In [20]:
c.drop(0, inplace=True)

In [24]:
c.reset_index(inplace=True)

# Merging the data

In [25]:
test = pd.concat([a,c], axis=1)

In [26]:
test

    index                   0  index             0
0       0  Scarlett Johansson      1  453,777,860,
1       1       Robert Downey      2  334,793,724,
2       3   Samuel L. Jackson      3  224,071,059,
3       4         Chris Pratt      4  580,991,995,
4       5     Chris Hemsworth      5  460,645,316,
..    ...                 ...    ...           ...
95     96      Channing Tatum     96  137,723,503,
96     97       Geoffrey Rush     97  258,223,222,
97     98          Mike Myers     98  292,932,685,
98     99     Sam Worthington     99  186,130,900,
99    100         Paul Walker    100   254,890,266

[100 rows x 4 columns]

In [27]:
del test['index']

In [28]:
test

                     0             0
0   Scarlett Johansson  453,777,860,
1        Robert Downey  334,793,724,
2    Samuel L. Jackson  224,071,059,
3          Chris Pratt  580,991,995,
4      Chris Hemsworth  460,645,316,
..                 ...           ...
95      Channing Tatum  137,723,503,
96       Geoffrey Rush  258,223,222,
97          Mike Myers  292,932,685,
98     Sam Worthington  186,130,900,
99         Paul Walker   254,890,266

[100 rows x 2 columns]

# Brand New CSV

In [31]:
test.columns= ['Actor', 'Gross Movie Earnings/Number of Movies']

In [32]:
test

                 Actor Gross Movie Earnings/Number of Movies
0   Scarlett Johansson                          453,777,860,
1        Robert Downey                          334,793,724,
2    Samuel L. Jackson                          224,071,059,
3          Chris Pratt                          580,991,995,
4      Chris Hemsworth                          460,645,316,
..                 ...                                   ...
95      Channing Tatum                          137,723,503,
96       Geoffrey Rush                          258,223,222,
97          Mike Myers                          292,932,685,
98     Sam Worthington                          186,130,900,
99         Paul Walker                           254,890,266

[100 rows x 2 columns]

In [34]:
test.to_csv('Actors___.csv')